# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)

['دبلوم', 'بكالوريوس', 'ماجستير', ' دبلوم عالي', 'دكتوراه'].each do |level_name|
  Level.create(name: level_name)
end

[
  'Islamic Monotheism',
  'Islamic Fiqh',
  'Prophetic hadith',
  'Quran',
  'English',
  'Arabic',
  'Chinese',
  'Math',
  'Biology',
  'Chemistry',
  'Physics'
].each{|subject| Subject.create(name: subject) }

COUNTRY = \
  [
    'الحدود الشمالية',
    'الجوف',
    'تبوك',
    'حائل',
    'القصيم',
    'الرياض',
    'المدينة',
    'عسير',
    'الباحة',
    'جازان',
    'مكة المكرمة',
    'نجران',
    'الشرقية'
  ]

CITY = \
  [
    ['طريف',1],
    ['عرعر',1 ],
    ['رفحاء',1],
    ['القريات',2 ],
    ['سكاكا',2 ],
    ['دومة الجندل',3 ],
    ['تبوك',3 ],
    ['الوجة',3 ],
    ['املج',3 ],
    ['ضبا',3 ],
    ['حايل',4 ],
    ['الشنان',4 ],
    ['بريدة',5 ],
    ['عنيزة',5 ],
    ['الرس',5 ],
    ['المذنب',5 ],
    ['رياض الخبراء',5 ],
    ['البدائع',5 ],
    ['البكيرية',5 ],
    ['الشماسية',5 ],
    ['الرياض',6 ],
    ['المجمعة',6 ],
    ['الزلفي',6 ],
    ['الغاط',6 ],
    ['عفيف',6 ],
    ['ثادق',6 ],
    ['شقراء',6 ],
    ['الدوادمي',6 ],
    ['الدرعية',6 ],
    ['القويعية',6 ],
    ['المزاحمية',6 ],
    ['الخرج',6 ],
    ['الدلم',6 ],
    ['السليل',6 ],
    ['الحريق',6 ],
    ['حوطة بني تميم',6 ],
    ['ليلى',6 ],
    ['المدينة المنورة',7 ],
    ['خيبر',7 ],
    ['ينبع',7 ],
    ['بدر',7 ],
    ['أبها',8 ],
    ['خميس مشيط',8 ],
    ['احد رفيدة',8 ],
    ['المجاردة',8 ],
    ['تثليث',8 ],
    ['بيشة',8 ],
    ['محايل عسير',8 ],
    ['بللسمر',8 ],
    ['الباحة',9 ],
    ['جيزان',10 ],
    ['صبيا',10 ],
    ['ابو عريش',10 ],
    ['صامطة',10 ],
    ['احد المسارحة',10 ],
    ['الطايف',11 ],
    ['مكه',11 ],
    ['جده',11 ],
    ['رابغ',11 ],
    ['الخرمة',11 ],
    ['الجموم',11 ],
    ['القنفذة',11 ],
    ['ثول',11 ],
    ['تربة',11 ],
    ['الملك عبدالله الاقتصادية',11 ],
    ['شرورة',12 ],
    ['نجران',12 ],
    ['الهفوف',13 ],
    ['الدمام',13 ],
    ['الخبر',13 ],
    ['حفر الباطن',13 ],
    ['القطيف',13 ],
    ['قرية العليا',13 ],
    ['الجبيل',13 ],
    ['النعيرية',13 ],
    ['الظهران',13 ],
    ['بقيق',13 ],
    ['سيهات',13 ],
    ['تاروت',13 ],
    ['صفوى',13 ],
    ['عنك',13 ],
    ['الخفجي',13 ],
    ['رأس تنورة',13 ]
  ]
    
COUNTRY.each{|country| Country.create(name: country) }
CITY.each{|city| City.create(name: city[0], country_id: city[1]) }